## Week 11b: SQLite and Pandas

In [2]:
import sqlite3
import pandas as pd

#### Establish a connection

In [3]:
conn = sqlite3.connect("pd_students.db") 
cur = conn.cursor()

#### Read in data

In [5]:
df = pd.read_csv("students_1.csv")
df.head()

      fname     lname      ID
0   Patrick     Ramos  387423
1    Walter      King  657953
2  Margaret    Brooks  264676
3     Betty    Murphy  705400
4    Pamela  Campbell  399844

### Send data to database

In [6]:
df.to_sql('students', conn, index=False) # default is to write the index as a column

10

In [7]:
rows = cur.execute("SELECT * FROM students").fetchall()
rows

[('Patrick', 'Ramos', 387423),
 ('Walter', 'King', 657953),
 ('Margaret', 'Brooks', 264676),
 ('Betty', 'Murphy', 705400),
 ('Pamela', 'Campbell', 399844),
 ('Victoria', 'Lee', 669408),
 ('Samantha', 'Peterson', 211134),
 ('Judith', 'Mendoza', 518833),
 ('Emily', 'Reed', 962205),
 ('Justin', 'Kelly', 660198)]

#### Commit and close

In [8]:
conn.commit()
conn.close()

### Add data to existing db

Add the `students_2.csv` data to the `pd_students table` using the `if_exists` optional parameter of `to_sql()`

In [9]:
conn = sqlite3.connect("pd_students.db") #, autocommit=False)
cur = conn.cursor()

df = pd.read_csv("students_2.csv")
df.head()

     fname     lname      ID
0    Randy  Martinez  122942
1  Russell  Williams  223293
2  Deborah    Nguyen  329265
3   Eugene      Hill  174267
4     John    Nguyen  650755

In [10]:
df.to_sql('students', conn, if_exists='append', index=False)

10

In [11]:
cur.execute("SELECT * FROM students").fetchall()

[('Patrick', 'Ramos', 387423),
 ('Walter', 'King', 657953),
 ('Margaret', 'Brooks', 264676),
 ('Betty', 'Murphy', 705400),
 ('Pamela', 'Campbell', 399844),
 ('Victoria', 'Lee', 669408),
 ('Samantha', 'Peterson', 211134),
 ('Judith', 'Mendoza', 518833),
 ('Emily', 'Reed', 962205),
 ('Justin', 'Kelly', 660198),
 ('Randy', 'Martinez', 122942),
 ('Russell', 'Williams', 223293),
 ('Deborah', 'Nguyen', 329265),
 ('Eugene', 'Hill', 174267),
 ('John', 'Nguyen', 650755),
 ('Tyler', 'Taylor', 380016),
 ('Catherine', 'Cox', 677895),
 ('Matthew', 'Collins', 253798),
 ('Billy', 'Ortiz', 400412),
 ('Gary', 'Patel', 784736)]

In [12]:
conn.commit()
conn.close()